[A_CreatureCyclops H7Creature]
mName="独眼巨人"
mLore="正如地精那样，独眼巨人也是制造兽人时的“失败产品”。带有大型恶魔的血统，使他们成为了巨人，身体和心灵在混沌怒潮中发生扭曲。不同的派系间都想控制这股强大的力量，但只有兽人有足够强壮、耐心和勇气能够“驯服”他们，并且让他们为其所用，他们在战场中作为重装突击部队和“投石机”发起强大的进攻。\n\n招募所需稀有资源： \n1 龙血水晶"